app/views/patients/show.html.erb

SELECT "symptoms".* FROM "symptoms"  WHERE "symptoms"."patient_id" = $1  [["patient_id", 2]]
---
<ul>
<% @patient.symptoms.each do |s| %>