app/controllers/drugs_controller.rb

SELECT "drugs".* FROM "drugs"
---
  def index
    @drugs = Drug.all

SELECT  "drugs".* FROM "drugs"  WHERE "drugs"."id" = $1 LIMIT 1  [["id", 0]]
---
    def set_drug
      @drug = Drug.find(params[:id])